docs/HL-tests/HL-test1/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="64000" />
  </clients>

  <servers>
    <server host="localhost" port="8087" type="tcp" /> 
  </servers>

  <load>
    <arrivalphase phase="1" duration="60" unit="second">
        <users maxnumber="63900" arrivalrate="2500" unit="second" />
    </arrivalphase>
  </load>

  <options>
    <option name="ports_range" min="1025" max="65535"/>
  </options>
  
  <sessions>
    <session name="websocket" probability="100" type="ts_websocket">
        <request>
             <websocket type="connect" path="/comet-server/ws/sesion=&amp;myid=&amp;devid=0&amp;v=3.24&amp;uuid=48wTOvoa-uEtC0thHzBkIKir14sXgkOy&amp;api=js"></websocket>
        </request>

       
        <for var="i" from="1" to="20000" incr="1">
          <thinktime value="150"/>
        </for>
        
        <request>
            <websocket type="close"></websocket>
        </request><!---->
    </session>
  </sessions>
</tsung>